{"title":"Cookbook Introduction","categories":["cookbook"],"order":10,"meta":{"keywords":null,"description":null},"content":"<h2 id=\"the-cookbook-vs-the-guide\"><a name=\"the-cookbook-vs-the-guide\" class=\"h-link\" href=\"#\"></a>The Cookbook vs the Guide</h2>\n<p>How is the cookbook different from the guide? Why is this necessary?</p>\n<ul>\n<li><strong>Greater Focus</strong>. In the guide, we're essentially telling a story. Each section builds on and assumes knowledge from each previous section. In the cookbook, each recipe stands on its own. This means recipes focus on one specific topic or use case, rather than having to give a general overview.</li>\n<li><strong>Greater Depth</strong>. To avoid making the guide too long, we try to include only the simplest possible examples to help you understand each feature. Then we move on. In the cookbook, we can include more complex examples, combining features in interesting ways. Each recipe can also be as long and detailed as it needs to be, in order to fully explore its niche.</li>\n<li><strong>Greater Complexity</strong>. In the guide, we assume at least intermediate familiarity with ES2015 JavaScript. In the cookbook however, you will see more TypeScript code, frontend and backend frameworks and libraries and real-world examples.</li>\n</ul>\n<blockquote>\n<p>For most of cookbook's content, you are expected to have a basic understanding of concepts like JavaScript, npm/yarn, commonjs, ES import/export, Node.js module resolution algorithm. Depending on the recipe you are expected to know frontend or backend libraries and frameworks.</p>\n</blockquote>\n<h2 id=\"cookbook-contributions\"><a name=\"cookbook-contributions\" class=\"h-link\" href=\"#\"></a>Cookbook Contributions</h2>\n<p>The Cookbook gives developers examples to work off of that both cover common or interesting use cases, and also progressively explain more complex detail. Our goal is to move beyond a simple introductory example, and demonstrate concepts that are more widely applicable, as well as some caveats to the approach.</p>\n<p>If you’re interested in contributing, please initiate collaboration by filing an issue under the tag <strong>cookbook idea</strong> with your concept so that we can help guide you to a successful pull request. After your idea has been approved, please follow the template below as much as possible. Some sections are required, and some are optional. Following the numerical order is strongly suggested, but not required.</p>\n<p>Recipes should generally:</p>\n<ul>\n<li>Solve a specific, common problem</li>\n<li>Start with the simplest possible example to demonstrate the issue</li>\n<li>Introduce complexities one at a time</li>\n<li>Link to other docs, rather than re-explaining concepts</li>\n<li>Describe the problem, rather than assuming familiarity</li>\n<li>Explain the process, rather than just the end result</li>\n<li>Explain the pros and cons of your strategy, including when it is and isn't appropriate</li>\n<li>Mention alternative solutions, if relevant, but leave in-depth explorations to a separate recipe</li>\n</ul>\n<p>We ask you to follow the template below. We understand, however, that there are times when you may necessarily need to deviate for clarity or flow. Either way, all recipes should at some point discuss the nuance of the choice made using this pattern, preferably in the form of the alternative patterns section.</p>\n<h3 id=\"the-issue\"><a name=\"the-issue\" class=\"h-link\" href=\"#\"></a>The issue</h3>\n<p><em>required</em></p>\n<ol>\n<li>Articulate the problem in a sentence or two.</li>\n<li>Show the simplest possible solution which leads to issues in the long run.</li>\n<li>Explain the <strong>disadvantages</strong> of this solution</li>\n</ol>\n<h3 id=\"the-solution\"><a name=\"the-solution\" class=\"h-link\" href=\"#\"></a>The solution</h3>\n<p><em>required</em></p>\n<ol>\n<li>Provide the suggested way to solve the issue</li>\n<li>Explain the <strong>advantages</strong> in comparison to the simplest solution described in the section above</li>\n<li>Discuss why this may be a compelling solution. Links for a reference are not required but encouraged</li>\n<li>Walk through a few terse examples</li>\n</ol>\n<h3 id=\"demo\"><a name=\"demo\" class=\"h-link\" href=\"#\"></a>Demo</h3>\n<p><em>required</em></p>\n<p>Demonstrate the code that would power a common or interesting use case by embedding a codesandbox/scrimba/codepen/jsfiddle example.</p>\n<h3 id=\"when-to-avoid\"><a name=\"when-to-avoid\" class=\"h-link\" href=\"#\"></a>When To Avoid</h3>\n<p><em>optional</em></p>\n<p>This section is not required, but heavily recommended. Here, we’ll take an honest look at when the pattern is useful and when it should be avoided, or when something else makes more sense.</p>\n<h3 id=\"alternative-ways\"><a name=\"alternative-ways\" class=\"h-link\" href=\"#\"></a>Alternative Ways</h3>\n<p><em>optional</em></p>\n<p>Similar to the previous section this one is optional, but very encouraged. The answer to most questions about development is <strong>&quot;It depends!&quot;</strong>. So, it’s important to explore other methods to let people compare and understand whether this solution makes sense in their situation.</p>\n<h2 id=\"thank-you\"><a name=\"thank-you\" class=\"h-link\" href=\"#\"></a>Thank you</h2>\n<p>It takes time to contribute to documentation, and if you spend the time to submit a PR to this section of our docs, you do so with our gratitude.</p>","headings":[{"id":"the-cookbook-vs-the-guide","title":"The Cookbook vs the Guide"},{"id":"cookbook-contributions","title":"Cookbook Contributions"},{"id":"the-issue","title":"The issue"},{"id":"the-solution","title":"The solution"},{"id":"demo","title":"Demo"},{"id":"when-to-avoid","title":"When To Avoid"},{"id":"alternative-ways","title":"Alternative Ways"},{"id":"thank-you","title":"Thank you"}],"id":"cookbook/intro"}